ErpTest/src/InformationRegisters/уатНоменклатураГСМ/уатНоменклатураГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГСМ</name>
  <comment>Доп. сведения для ГСМ</comment>
  <resources>
    <name>ВестиУчетОстатковТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаГСМ</name>
    <type>
      <types>EnumRef.уатГруппыГСМ</types>
    </type>
  </resources>
  <resources>
    <name>ГСМТалона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЛитровыйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоминалТалона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатНоменклатураГрузов/уатНоменклатураГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГрузов</name>
  <resources>
    <name>Класс</name>
    <comment>Класс груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <comment>Количество мест</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТемператураДо</name>
    <comment>Значение конца диапазона температуры в градусах цельсия хранения/транспортировки груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТемператураОт</name>
    <comment>Значение начала диапазона температуры в градусах цельсия хранения/транспортировки груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВес</name>
    <comment>Удалить в релизе 2.0.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВысотаГруза</name>
    <comment>Удалить в релизе 2.0.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьДлинаГруза</name>
    <comment>Удалить в релизе 2.0.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОбъем</name>
    <comment>Удалить в релизе 2.0.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьОпасныйГруз</name>
    <comment>Признак опасного груза</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьШиринаГруза</name>
    <comment>Удалить в релизе 2.0.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатГруппыГСМ/уатГруппыГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппыГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Топливо</name>
  </enumValues>
  <enumValues>
    <name>Масло</name>
  </enumValues>
  <enumValues>
    <name>Талон</name>
  </enumValues>
  <enumValues>
    <name>ПрисадкиИТехническиеЖидкости</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonModules/уатЗащищенныеФункцииКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Защищенные функции клиенсткого контекста.
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ И ФУНЦИИ ОТКРЫТИЯ ОБЪЕКТОВ

// Общая процедура проверки защиты при событии "При открытии" всех форм 
//
Процедура уатФормаПриОткрытии(Отказ, ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.уатИнициализацияСеансаКлиент(ДопПараметры);
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Отказ") И ДопПараметры.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка справочника 
//
Процедура уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметры) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента справочника
//
Процедура уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка документа
//
Процедура уатДокументФормаСпискаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента документа
//
Процедура уатДокументФормаЭлементаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы обработки
//
Процедура уатОбработкаФормаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка регистра
//
Процедура уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, ДопПараметры);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С ГСМ

//Выбор номенклатуры из регистра сведений НоменклатураГСМ с отбором Топливо и выбранной номенклатуре
//
//  Параметры:
//    Отбор - массив, состоящий из структур вида:
//      * Поле           - строка - поле компоновки данных
//      * ВидСравнения   - видсравненияКД - вид сравнения компоновки данных
//      * Значение - значение отбора
//
Процедура ВыбратьГСМ(ГруппаГСМ = Неопределено, Форма, ДополнительныеПараметры = Неопределено) ЭКСПОРТ
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГСМ", Истина);
	
	Если ЗначениеЗаполнено(ГруппаГСМ) Тогда
		ПараметрыФормы.Вставить("ГруппаГСМ", ГруппаГСМ);
	Иначе
		ПараметрыФормы.Вставить("ГруппаГСМ", ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ЗначениеГСМДоИзменения") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.ЗначениеГСМДоИзменения);
		ИначеЕсли ДополнительныеПараметры.Свойство("НачальноеЗначениеВыбора") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.НачальноеЗначениеВыбора);
		КонецЕсли;
	КонецЕсли;
	
	КлючУникальности = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("КлючУникальности") Тогда
		КлючУникальности = ДополнительныеПараметры.КлючУникальности;
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("РегистрСведений.уатНоменклатураГСМ.ФормаСписка", ПараметрыФормы,, КлючУникальности);
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("Отбор") Тогда 
		Для Каждого ТекОтбор Из ДополнительныеПараметры.Отбор Цикл 
			уатИнтерфейсВзаимодействияСERPКлиентСервер.уатУстановитьЭлементОтбораСписка(ФормаВыбора.Список, 
																	ТекОтбор.Поле, 
																	ТекОтбор.Значение, 
																	ТекОтбор.ВидСравнения);
		КонецЦикла;
	КонецЕсли;
	
	ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Если Форма <> Неопределено И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ИмяПроцедурыОписаниеОповещения") Тогда
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяПроцедурыОписаниеОповещения,
			Форма, 
			ДополнительныеПараметры);
	КонецЕсли;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры // ВыбратьГСМ

// Возвращает форму списка ГСМ
Процедура СписокГСМдляТС(Организация, ТС, ГруппаГСМ, БезАналогов = Ложь, УчитыватьТЖ = Ложь, Форма, ДополнительныеПараметры = Неопределено) ЭКСПОРТ
	ПараметрыФормы = Новый Структура("ГруппаГСМ, ТС, Организация, БезАналогов, УчитыватьТЖ", ГруппаГСМ, ТС, Организация, БезАналогов, УчитыватьТЖ);
	Если Форма <> Неопределено И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		ОписаниеОповещенияЗакр = Новый ОписаниеОповещения(ДополнительныеПараметры.ИмяПроцедурыОписаниеОповещения, Форма, ДополнительныеПараметры);
	Иначе
		ОписаниеОповещенияЗакр = Неопределено;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.уатСписокГСМ", ПараметрыФормы,,,,, ОписаниеОповещенияЗакр, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатСписокГСМдляТС


////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С ГРУЗАМИ

//Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ДиалогВыбораГруза(Элемент, Номенклатура, ВладелецФормы, СтандартнаяОбработка) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, Номенклатура);
	ОткрытьФорму("РегистрСведений.уатНоменклатураГрузов.Форма.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
КонецПроцедуры // уатДиалогВыбораГруза       


////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С СОТРУДНИКАМИ

//Выбор сотрудника/водителя из спр. Сотрудники с помощью форм обработки уатСотрудники
// Параметры:
//	- Элемент, связанный с сотрудником
//	- ТекСотрудник, ссылка на данные сотрудника
//	- ПараметрыОтбора, структура отбора
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ДиалогВыбораСотрудника(Элемент, ТекСотрудник, ПараметрыОтбора, СтандартнаяОбработка) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, ТекСотрудник);
	//установим необходимые отборы
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

//Открытие формы элемента сотрудника/водителя из спр. Сотрудники с помощью формы обработки уатСотрудники
// Параметры:
//	- ТекСотрудник, ссылка на данные сотрудника
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ОткрытьФормуСотрудника(ТекСотрудник, СтандартнаяОбработка) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(ТекСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Неопределено, ТекСотрудник);
КонецПроцедуры
